app/controllers/shows_controller.rb

  def index
    @shows = Show.includes(:channel).all
    if params[:search].present?
      @shows = @shows.where("lower(shows.name) LIKE (?) OR lower(channels.name) LIKE (?)","%#{params[:search].strip.downcase}%","%#{params[:search].strip.downcase}%").references(:channels)
---
SELECT `channels`.* FROM `channels` WHERE `channels`.`id` IN (2, 1)
SELECT `shows`.* FROM `shows` WHERE (lower(shows.name) LIKE ('%dis%') OR lower(channels.name) LIKE ('%dis%'))

  def mark_as_favourite
    if params[:show_id].present?
      @favourite = Favourite.new
      @favourite.user_id = current_user.id
      @favourite.show_id = params[:show_id]
      if @favourite.save
---
INSERT INTO `favourites` (`user_id`, `show_id`, `created_at`, `updated_at`) VALUES (1, 1, '2020-03-05 06:43:39.770601', '2020-03-05 06:43:39.770601')