app/views/shows/index.html.erb


        <% unless show.favourites.pluck(:user_id).include?(current_user.id) %>
---
SELECT `favourites`.`user_id` FROM `favourites` WHERE `favourites`.`show_id` = 1